//---------------------------------------------------------------------------
#ifndef __OLE2UTIL_H__
#define __OLE2UTIL_H__
//---------------------------------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif  // __cplusplus
//---------------------------------------------------------------------------
#include "OLE2Type.h"
//---------------------------------------------------------------------------
// Проверка, содержит ли имя записи каталога недопустимые символы
int IsDirEntryNameValid(
  const void *pDirEntryName
  );
// Преобразование имени записи каталога в имя файла
size_t DirEntryNameToFileName(
  const void *pDirEntryName,
  wchar_t *pwszDest,
  size_t cchDestLength
  );
//---------------------------------------------------------------------------
#ifdef __cplusplus
}  // extern "C"
#endif // __cplusplus
//---------------------------------------------------------------------------
#endif  // __OLE2UTIL_H__
