//---------------------------------------------------------------------------
#ifndef __OLE2DOC_H__
#define __OLE2DOC_H__
//---------------------------------------------------------------------------
#include "OLE2Type.h"
//---------------------------------------------------------------------------
// Сигнатура потока документа Word97
#define WORD97_FILE_IDENT  0x0A5EC
// Сигнатура потока документа Word6 / Word95
#define WORD6_FILE_IDENT   0x0A5DC
//---------------------------------------------------------------------------
#pragma pack(push, 1)
//---------------------------------------------------------------------------
/***************************************************************************/
/* FibBase (Базовая часть заголовка документа)                             */
/***************************************************************************/
typedef struct _FIBBASE
{
  uint16_t  wIdent;                         // 0000: Сигнатура
  uint16_t  nFib;                           // 0002: Номер версии формата
                                            //       (=0x00C1)
  uint16_t  nProduct;                       // 0004: Версия продукта
  uint16_t  lid;                            // 0006: Идентификатор языка
  uint16_t  pnNext;                         // 0008: Смещение FIB элементов
                                            //       AutoText (в блоках по
                                            //       512 байтов)
  uint16_t  wFlags1;                        // 000A: Флаги
  uint16_t  nFibBack;                       // 000C: Номер версии формата,
                                            //       совместимого для чтения
                                            //       (=0x00BF или =0x00C1)
  uint32_t  lKey;                           // 000E: Ключ шифрования
  uint8_t   envr;                           // 0012: Среда создания документа
                                            //       (=0x00 - Win Word)
                                            //       (=0x01 - Mac Word)
  uint8_t   bFlags2;                        // 0013: Флаги 2
  uint16_t  chs;                            // 0014:
  uint16_t  chsTables;                      // 0016:
  uint32_t  fcMin;                          // 0018: Смещение первого символа
                                            //       текста
  uint32_t  fcMax;                          // 001C: Смещение последнего
                                            //       символа текста + 1
} FIBBASE, *PFIBBASE;

#define FIBBASE_SIZE  32

// Флаги
#define FIB_FLAG_DOT                0x0001  // Документ - шаблон
#define FIB_FLAG_GLSY               0x0002  // Документ - глоссарий
#define FIB_FLAG_COMPLEX            0x0004  // Документ - комплексный,
                                            // сохранен в формате быстрого
                                            // сохранения
#define FIB_FLAG_HASPIC             0x0008  // Документ содержит рисунки
#define FIB_FLAG_QUICKSAVES_MASK    0x00F0  // Маска числа быстрых сохранений
                                            // =0xF - nFib >= 0x00D9
#define FIB_FLAG_ENCRYPTED          0x0100  // Документ зашифрован или
                                            // обфусцирован
#define FIB_FLAG_WHICHTBLSTM        0x0200  // Используемый поток
                                            // 0Table / 1Table
#define FIB_FLAG_READONLYRECOMMENDED  0x0400  // Рекомендуется доступ только
                                              // для чтения
#define FIB_FLAG_WRITERESERVATION   0x0800  // 0x0800 - Документ имеет пароль
                                            // для записи
#define FIB_FLAG_EXTCHAR            0x1000  // Используется расширенный набор
                                            // символов
#define FIB_FLAG_LOADOVERRIDE       0x2000  // Необходимо переопределить
                                            // информацию о языке и шрифте
#define FIB_FLAG_FAREAST            0x4000  // Документ создан на языке
                                            // Восточной Азии
#define FIB_FLAG_OBFUSCATED         0x8000  // Документ обфусцирован
                                            // (если установлен флаг
                                            // FIB_FLAG_ENCRYPTED,
                                            // используется XOR обфускация)

// Флаги 2
#define FIB_FLAG2_MAC               0x01    // Документ сохранен в среде Mac
#define FIB_FLAG2_EMPTYSPECIAL      0x02
#define FIB_FLAG2_LOADOVERRIDEPAGE  0x04    // Необходимо переопределить
                                            // свойства раздела
#define FIB_FLAG2_FUTURESAVEDUNDO   0x08
#define FIB_FLAG2_WORD97SAVED       0x10
#define FIB_FLAG2_SPARE0_MASK       0xE0

/***************************************************************************/
/* FibRgW97 (Вторая часть заголовка документа с 16-битными значениями)     */
/***************************************************************************/
typedef struct _FIBRGW97
{
  uint16_t  wMagicCreated;                  // 0022: Уникальный номер,
                                            //       идентифицирующий
                                            //       программу, создавшую
                                            //       документа
                                            //       (0x6A62 - Word)
  uint16_t  wMagicRevised;                  // 0024: Идентификатор последней
                                            //       программы, изменившей
                                            //       документ
  uint16_t  wMagicCreatedPrivate;           // 0026:
  uint16_t  wMagicRevisedPrivate;           // 0028:
  uint16_t  pnFbpChpFirst_W6;               // 002A:
  uint16_t  pnChpFirst_W6;                  // 002C:
  uint16_t  cpnBteChp_W6;                   // 002E:
  uint16_t  pnFbpPapFirst_W6;               // 0030:
  uint16_t  pnPapFirst_W6;                  // 0032:
  uint16_t  cpnBtePap_W6;                   // 0034:
  uint16_t  pnFbpLvcFirst_W6;               // 0036:
  uint16_t  pnLvcFirst_W6;                  // 0038:
  uint16_t  cpnBteLvc_W6;                   // 003A:
  uint16_t  lidFE;                          // 003C: Идентификатор языка для
                                            //       документа, созданного на
                                            //       языке Восточной Азии
} FIBRGW97, *PFIBRGW97;

#define FIBRGW97_SIZE  28

/***************************************************************************/
/* FibRgLW97 (Третья часть заголовка документа с 32-битными значениями)    */
/***************************************************************************/
typedef struct _FIBRGLW97
{
  uint32_t  cbMac;                          // 0040:
  uint32_t  lProductCreated;                // 0044: Дата компиляции
                                            //       программы, создавшей
                                            //       документ
  uint32_t  lProductRevised;                // 0048: Дата компиляции
                                            //       программы, изменившей
                                            //       документ
  int32_t   ccpText;                        // 004C: Количество символов в
                                            //       основном документе
  int32_t   ccpFtn;                         // 0050: Количество символов в
                                            //       сносках
  int32_t   ccpHdd;                         // 0054: Количество символов в
                                            //       заголовках
  int32_t   ccpMcr;                         // 0058: Количество символов в
                                            //       макросах
                                            //       (=0)
  int32_t   ccpAtn;                         // 005C: Количество символов в
                                            //       аннотациях
  int32_t   ccpEdn;                         // 0060: Количество символов
                                            //       в сносках
  int32_t   ccpTxbx;                        // 0064: Количество символов в
                                            //       текстовых полях
  int32_t   ccpHdrTxbx;                     // 0068: Количество символов в
                                            //       текстовых полях
                                            //       заголовков
} FIBRGLW97, *PFIBRGLW97;

#define FIBRGLW97_SIZE  44  // 88

/***************************************************************************/
/* Смещение и размер таблицы Clx                                           */
/***************************************************************************/
typedef struct _FIBCLXFCLCB
{
  uint32_t  fcClx;
  uint32_t  lcbClx;
} FIBCLXFCLCB, *PFIBCLXFCLCB;

// Индекс пары fcClx и lcbClx в структуре FibRgFcLcb97
#define FIBCLXFCLCB_INDEX  33

/***************************************************************************/
/* Информация о положении текста в потоке и дополнительные свойства текста */
/***************************************************************************/
typedef struct _PCD
{
  uint16_t  wFlags;
  uint32_t  fc;
  uint16_t  prm;
} PCD, *PPCD;

#define PCD_FC_MASK        0x3FFFFFFF       // Маска смещения текста
#define PCD_FC_COMPRESSED  0x40000000       // Текст сжат (ANSI)

#define PCD_PRM_COMPLEX    0x0001           // Тип используемой
                                            // структуры Prm0 / Prm1
//---------------------------------------------------------------------------
#pragma pack(pop)
//---------------------------------------------------------------------------
#endif  // __OLE2DOC_H__
