//---------------------------------------------------------------------------
#ifndef __OLE2MSI_H__
#define __OLE2MSI_H__
//---------------------------------------------------------------------------
#include "OLE2Type.h"
#include "OLE2File.h"
//---------------------------------------------------------------------------
// Максимальная длина имени записи каталога MSI
#define MAX_MSI_DIR_ENTRY_NAME_LEN  64

// Специальный символ MSI
#define MSI_SPEC_CHAR  L'!'
//---------------------------------------------------------------------------
// Декодирование имени записи каталога MSI
size_t DecodeMsiDirEntryName(
  const void *pDirEntryName,
  wchar_t *pwszDest,
  size_t cchDestLength
  );
// Детектирование файла-контейнера MSI
bool DetectMsi(
  const COLE2File *pOLE2File
  );
//---------------------------------------------------------------------------
#endif  // __OLE2MSI_H__
